Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/trng.h
/**
 * \brief Component description for TRNG
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_TRNG_COMPONENT_H_
#define _SAM9X_TRNG_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TRNG                                         */
/* ************************************************************************** */

/* -------- TRNG_CR : (TRNG Offset: 0x00) ( /W 32) Control Register -------- */
#define TRNG_CR_ENABLE_Pos                    _U_(0)                                               /**< (TRNG_CR) Enable TRNG to Provide Random Values Position */
#define TRNG_CR_ENABLE_Msk                    (_U_(0x1) << TRNG_CR_ENABLE_Pos)                     /**< (TRNG_CR) Enable TRNG to Provide Random Values Mask */
#define TRNG_CR_ENABLE(value)                 (TRNG_CR_ENABLE_Msk & ((value) << TRNG_CR_ENABLE_Pos))
#define TRNG_CR_WAKEY_Pos                     _U_(8)                                               /**< (TRNG_CR) Register Write Access Key Position */
#define TRNG_CR_WAKEY_Msk                     (_U_(0xFFFFFF) << TRNG_CR_WAKEY_Pos)                 /**< (TRNG_CR) Register Write Access Key Mask */
#define TRNG_CR_WAKEY(value)                  (TRNG_CR_WAKEY_Msk & ((value) << TRNG_CR_WAKEY_Pos))
#define   TRNG_CR_WAKEY_PASSWD_Val            _U_(0x524E47)                                        /**< (TRNG_CR) Writing any other value in this field aborts the write operation.  */
#define TRNG_CR_WAKEY_PASSWD                  (TRNG_CR_WAKEY_PASSWD_Val << TRNG_CR_WAKEY_Pos)      /**< (TRNG_CR) Writing any other value in this field aborts the write operation. Position  */
#define TRNG_CR_Msk                           _U_(0xFFFFFF01)                                      /**< (TRNG_CR) Register Mask  */


/* -------- TRNG_MR : (TRNG Offset: 0x04) (R/W 32) Mode Register -------- */
#define TRNG_MR_HALFR_Pos                     _U_(0)                                               /**< (TRNG_MR) Half Rate Enable Position */
#define TRNG_MR_HALFR_Msk                     (_U_(0x1) << TRNG_MR_HALFR_Pos)                      /**< (TRNG_MR) Half Rate Enable Mask */
#define TRNG_MR_HALFR(value)                  (TRNG_MR_HALFR_Msk & ((value) << TRNG_MR_HALFR_Pos))
#define TRNG_MR_Msk                           _U_(0x00000001)                                      /**< (TRNG_MR) Register Mask  */


/* -------- TRNG_PKBCR : (TRNG Offset: 0x08) ( /W 32) Private Key Bus Control Register -------- */
#define TRNG_PKBCR_KID_Pos                    _U_(0)                                               /**< (TRNG_PKBCR) Key ID (Must be Always Written to 0) Position */
#define TRNG_PKBCR_KID_Msk                    (_U_(0x1) << TRNG_PKBCR_KID_Pos)                     /**< (TRNG_PKBCR) Key ID (Must be Always Written to 0) Mask */
#define TRNG_PKBCR_KID(value)                 (TRNG_PKBCR_KID_Msk & ((value) << TRNG_PKBCR_KID_Pos))
#define TRNG_PKBCR_KSLAVE_Pos                 _U_(4)                                               /**< (TRNG_PKBCR) Key Bus Slave Position */
#define TRNG_PKBCR_KSLAVE_Msk                 (_U_(0x3) << TRNG_PKBCR_KSLAVE_Pos)                  /**< (TRNG_PKBCR) Key Bus Slave Mask */
#define TRNG_PKBCR_KSLAVE(value)              (TRNG_PKBCR_KSLAVE_Msk & ((value) << TRNG_PKBCR_KSLAVE_Pos))
#define   TRNG_PKBCR_KSLAVE_TDES_ID_Val       _U_(0x0)                                             /**< (TRNG_PKBCR) Selects the TDES.  */
#define   TRNG_PKBCR_KSLAVE_AES_ID_Val        _U_(0x1)                                             /**< (TRNG_PKBCR) Selects the AES.  */
#define   TRNG_PKBCR_KSLAVE_OTPC_ID_Val       _U_(0x2)                                             /**< (TRNG_PKBCR) Selects the OTPC.  */
#define TRNG_PKBCR_KSLAVE_TDES_ID             (TRNG_PKBCR_KSLAVE_TDES_ID_Val << TRNG_PKBCR_KSLAVE_Pos) /**< (TRNG_PKBCR) Selects the TDES. Position  */
#define TRNG_PKBCR_KSLAVE_AES_ID              (TRNG_PKBCR_KSLAVE_AES_ID_Val << TRNG_PKBCR_KSLAVE_Pos) /**< (TRNG_PKBCR) Selects the AES. Position  */
#define TRNG_PKBCR_KSLAVE_OTPC_ID             (TRNG_PKBCR_KSLAVE_OTPC_ID_Val << TRNG_PKBCR_KSLAVE_Pos) /**< (TRNG_PKBCR) Selects the OTPC. Position  */
#define TRNG_PKBCR_KLENGTH_Pos                _U_(8)                                               /**< (TRNG_PKBCR) Key Length Position */
#define TRNG_PKBCR_KLENGTH_Msk                (_U_(0xFF) << TRNG_PKBCR_KLENGTH_Pos)                /**< (TRNG_PKBCR) Key Length Mask */
#define TRNG_PKBCR_KLENGTH(value)             (TRNG_PKBCR_KLENGTH_Msk & ((value) << TRNG_PKBCR_KLENGTH_Pos))
#define TRNG_PKBCR_WAKEY_Pos                  _U_(16)                                              /**< (TRNG_PKBCR) Register Write Access Key Position */
#define TRNG_PKBCR_WAKEY_Msk                  (_U_(0xFFFF) << TRNG_PKBCR_WAKEY_Pos)                /**< (TRNG_PKBCR) Register Write Access Key Mask */
#define TRNG_PKBCR_WAKEY(value)               (TRNG_PKBCR_WAKEY_Msk & ((value) << TRNG_PKBCR_WAKEY_Pos))
#define   TRNG_PKBCR_WAKEY_PASSWD_Val         _U_(0x524B)                                          /**< (TRNG_PKBCR) Writing any other value in this field aborts the write operation.  */
#define TRNG_PKBCR_WAKEY_PASSWD               (TRNG_PKBCR_WAKEY_PASSWD_Val << TRNG_PKBCR_WAKEY_Pos) /**< (TRNG_PKBCR) Writing any other value in this field aborts the write operation. Position  */
#define TRNG_PKBCR_Msk                        _U_(0xFFFFFF31)                                      /**< (TRNG_PKBCR) Register Mask  */


