Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/trng.h
/* -------- TRNG_ODATA : (TRNG Offset: 0x50) ( R/ 32) Output Data Register -------- */
#define TRNG_ODATA_ODATA_Pos                  _U_(0)                                               /**< (TRNG_ODATA) Output Data Position */
#define TRNG_ODATA_ODATA_Msk                  (_U_(0xFFFFFFFF) << TRNG_ODATA_ODATA_Pos)            /**< (TRNG_ODATA) Output Data Mask */
#define TRNG_ODATA_ODATA(value)               (TRNG_ODATA_ODATA_Msk & ((value) << TRNG_ODATA_ODATA_Pos))
#define TRNG_ODATA_Msk                        _U_(0xFFFFFFFF)                                      /**< (TRNG_ODATA) Register Mask  */


/* -------- TRNG_WPMR : (TRNG Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define TRNG_WPMR_WPEN_Pos                    _U_(0)                                               /**< (TRNG_WPMR) Write Protection Enable Position */
#define TRNG_WPMR_WPEN_Msk                    (_U_(0x1) << TRNG_WPMR_WPEN_Pos)                     /**< (TRNG_WPMR) Write Protection Enable Mask */
#define TRNG_WPMR_WPEN(value)                 (TRNG_WPMR_WPEN_Msk & ((value) << TRNG_WPMR_WPEN_Pos))
#define TRNG_WPMR_WPITEN_Pos                  _U_(1)                                               /**< (TRNG_WPMR) Write Protection Interrupt Enable Position */
#define TRNG_WPMR_WPITEN_Msk                  (_U_(0x1) << TRNG_WPMR_WPITEN_Pos)                   /**< (TRNG_WPMR) Write Protection Interrupt Enable Mask */
#define TRNG_WPMR_WPITEN(value)               (TRNG_WPMR_WPITEN_Msk & ((value) << TRNG_WPMR_WPITEN_Pos))
#define TRNG_WPMR_WPCREN_Pos                  _U_(2)                                               /**< (TRNG_WPMR) Write Protection Control Enable Position */
#define TRNG_WPMR_WPCREN_Msk                  (_U_(0x1) << TRNG_WPMR_WPCREN_Pos)                   /**< (TRNG_WPMR) Write Protection Control Enable Mask */
#define TRNG_WPMR_WPCREN(value)               (TRNG_WPMR_WPCREN_Msk & ((value) << TRNG_WPMR_WPCREN_Pos))
#define TRNG_WPMR_FIRSTE_Pos                  _U_(4)                                               /**< (TRNG_WPMR) First Error Report Enable Position */
#define TRNG_WPMR_FIRSTE_Msk                  (_U_(0x1) << TRNG_WPMR_FIRSTE_Pos)                   /**< (TRNG_WPMR) First Error Report Enable Mask */
#define TRNG_WPMR_FIRSTE(value)               (TRNG_WPMR_FIRSTE_Msk & ((value) << TRNG_WPMR_FIRSTE_Pos))
#define TRNG_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (TRNG_WPMR) Write Protection Key Position */
#define TRNG_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << TRNG_WPMR_WPKEY_Pos)               /**< (TRNG_WPMR) Write Protection Key Mask */
#define TRNG_WPMR_WPKEY(value)                (TRNG_WPMR_WPKEY_Msk & ((value) << TRNG_WPMR_WPKEY_Pos))
#define   TRNG_WPMR_WPKEY_PASSWD_Val          _U_(0x524E47)                                        /**< (TRNG_WPMR) Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN.Always reads as 0.  */
#define TRNG_WPMR_WPKEY_PASSWD                (TRNG_WPMR_WPKEY_PASSWD_Val << TRNG_WPMR_WPKEY_Pos)  /**< (TRNG_WPMR) Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN.Always reads as 0. Position  */
#define TRNG_WPMR_Msk                         _U_(0xFFFFFF17)                                      /**< (TRNG_WPMR) Register Mask  */


/* -------- TRNG_WPSR : (TRNG Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define TRNG_WPSR_WPVS_Pos                    _U_(0)                                               /**< (TRNG_WPSR) Write Protection Violation Status (cleared on read) Position */
#define TRNG_WPSR_WPVS_Msk                    (_U_(0x1) << TRNG_WPSR_WPVS_Pos)                     /**< (TRNG_WPSR) Write Protection Violation Status (cleared on read) Mask */
#define TRNG_WPSR_WPVS(value)                 (TRNG_WPSR_WPVS_Msk & ((value) << TRNG_WPSR_WPVS_Pos))
#define TRNG_WPSR_CGD_Pos                     _U_(1)                                               /**< (TRNG_WPSR) Clock Glitch Detected (cleared on read) Position */
#define TRNG_WPSR_CGD_Msk                     (_U_(0x1) << TRNG_WPSR_CGD_Pos)                      /**< (TRNG_WPSR) Clock Glitch Detected (cleared on read) Mask */
#define TRNG_WPSR_CGD(value)                  (TRNG_WPSR_CGD_Msk & ((value) << TRNG_WPSR_CGD_Pos))
#define TRNG_WPSR_SEQE_Pos                    _U_(2)                                               /**< (TRNG_WPSR) Internal Sequencer Error (cleared on read) Position */
#define TRNG_WPSR_SEQE_Msk                    (_U_(0x1) << TRNG_WPSR_SEQE_Pos)                     /**< (TRNG_WPSR) Internal Sequencer Error (cleared on read) Mask */
#define TRNG_WPSR_SEQE(value)                 (TRNG_WPSR_SEQE_Msk & ((value) << TRNG_WPSR_SEQE_Pos))
#define TRNG_WPSR_SWE_Pos                     _U_(3)                                               /**< (TRNG_WPSR) Software Control Error (cleared on read) Position */
#define TRNG_WPSR_SWE_Msk                     (_U_(0x1) << TRNG_WPSR_SWE_Pos)                      /**< (TRNG_WPSR) Software Control Error (cleared on read) Mask */
#define TRNG_WPSR_SWE(value)                  (TRNG_WPSR_SWE_Msk & ((value) << TRNG_WPSR_SWE_Pos))
#define TRNG_WPSR_WPVSRC_Pos                  _U_(8)                                               /**< (TRNG_WPSR) Write Protection Violation Source (cleared on read) Position */
#define TRNG_WPSR_WPVSRC_Msk                  (_U_(0xFFFF) << TRNG_WPSR_WPVSRC_Pos)                /**< (TRNG_WPSR) Write Protection Violation Source (cleared on read) Mask */
#define TRNG_WPSR_WPVSRC(value)               (TRNG_WPSR_WPVSRC_Msk & ((value) << TRNG_WPSR_WPVSRC_Pos))
#define TRNG_WPSR_SWETYP_Pos                  _U_(24)                                              /**< (TRNG_WPSR) Software Error Type (cleared on read) Position */
#define TRNG_WPSR_SWETYP_Msk                  (_U_(0xF) << TRNG_WPSR_SWETYP_Pos)                   /**< (TRNG_WPSR) Software Error Type (cleared on read) Mask */
#define TRNG_WPSR_SWETYP(value)               (TRNG_WPSR_SWETYP_Msk & ((value) << TRNG_WPSR_SWETYP_Pos))
#define   TRNG_WPSR_SWETYP_READ_WO_Val        _U_(0x0)                                             /**< (TRNG_WPSR) TRNG is enabled and a write-only register has been read (Warning).  */
#define   TRNG_WPSR_SWETYP_WRITE_RO_Val       _U_(0x1)                                             /**< (TRNG_WPSR) TRNG is enabled and a write access has been performed on a read-only register (Warning).  */
#define   TRNG_WPSR_SWETYP_UNDEF_RW_Val       _U_(0x2)                                             /**< (TRNG_WPSR) Access to an undefined address.  */
#define   TRNG_WPSR_SWETYP_TRNG_DIS_Val       _U_(0x3)                                             /**< (TRNG_WPSR) The TRNG_ODATA register was read when TRNG was disabled or TRNG used for private key bus transfer (Error).  */
#define   TRNG_WPSR_SWETYP_PKB_BUSY_Val       _U_(0x4)                                             /**< (TRNG_WPSR) A write access to the PKB_CTRL register has been attempted during a private key bus transfer (Error).  */
#define TRNG_WPSR_SWETYP_READ_WO              (TRNG_WPSR_SWETYP_READ_WO_Val << TRNG_WPSR_SWETYP_Pos) /**< (TRNG_WPSR) TRNG is enabled and a write-only register has been read (Warning). Position  */
#define TRNG_WPSR_SWETYP_WRITE_RO             (TRNG_WPSR_SWETYP_WRITE_RO_Val << TRNG_WPSR_SWETYP_Pos) /**< (TRNG_WPSR) TRNG is enabled and a write access has been performed on a read-only register (Warning). Position  */
#define TRNG_WPSR_SWETYP_UNDEF_RW             (TRNG_WPSR_SWETYP_UNDEF_RW_Val << TRNG_WPSR_SWETYP_Pos) /**< (TRNG_WPSR) Access to an undefined address. Position  */
#define TRNG_WPSR_SWETYP_TRNG_DIS             (TRNG_WPSR_SWETYP_TRNG_DIS_Val << TRNG_WPSR_SWETYP_Pos) /**< (TRNG_WPSR) The TRNG_ODATA register was read when TRNG was disabled or TRNG used for private key bus transfer (Error). Position  */
#define TRNG_WPSR_SWETYP_PKB_BUSY             (TRNG_WPSR_SWETYP_PKB_BUSY_Val << TRNG_WPSR_SWETYP_Pos) /**< (TRNG_WPSR) A write access to the PKB_CTRL register has been attempted during a private key bus transfer (Error). Position  */
#define TRNG_WPSR_ECLASS_Pos                  _U_(31)                                              /**< (TRNG_WPSR) Software Error Class (cleared on read) Position */
#define TRNG_WPSR_ECLASS_Msk                  (_U_(0x1) << TRNG_WPSR_ECLASS_Pos)                   /**< (TRNG_WPSR) Software Error Class (cleared on read) Mask */
#define TRNG_WPSR_ECLASS(value)               (TRNG_WPSR_ECLASS_Msk & ((value) << TRNG_WPSR_ECLASS_Pos))
#define   TRNG_WPSR_ECLASS_WARNING_Val        _U_(0x0)                                             /**< (TRNG_WPSR) An abnormal access that does not affect system functionality.  */
#define   TRNG_WPSR_ECLASS_ERROR_Val          _U_(0x1)                                             /**< (TRNG_WPSR) Reading TRNG_ODATA when TRNG was disabled or TRNG used for private key bus transfer. TRNG does not provide a random value.Writing to the PKB_CTRL register while a private key bus transfer is ongoing does not launch a new private key bus transfer.  */
#define TRNG_WPSR_ECLASS_WARNING              (TRNG_WPSR_ECLASS_WARNING_Val << TRNG_WPSR_ECLASS_Pos) /**< (TRNG_WPSR) An abnormal access that does not affect system functionality. Position  */
#define TRNG_WPSR_ECLASS_ERROR                (TRNG_WPSR_ECLASS_ERROR_Val << TRNG_WPSR_ECLASS_Pos) /**< (TRNG_WPSR) Reading TRNG_ODATA when TRNG was disabled or TRNG used for private key bus transfer. TRNG does not provide a random value.Writing to the PKB_CTRL register while a private key bus transfer is ongoing does not launch a new private key bus transfer. Position  */
#define TRNG_WPSR_Msk                         _U_(0x8FFFFF0F)                                      /**< (TRNG_WPSR) Register Mask  */


/* -------- TRNG_VERSION : (TRNG Offset: 0xFC) ( R/ 32) Version Register -------- */
#define TRNG_VERSION_VERSION_Pos              _U_(0)                                               /**< (TRNG_VERSION) Version of the Hardware Module Position */
#define TRNG_VERSION_VERSION_Msk              (_U_(0xFFF) << TRNG_VERSION_VERSION_Pos)             /**< (TRNG_VERSION) Version of the Hardware Module Mask */
#define TRNG_VERSION_VERSION(value)           (TRNG_VERSION_VERSION_Msk & ((value) << TRNG_VERSION_VERSION_Pos))
#define TRNG_VERSION_MFN_Pos                  _U_(16)                                              /**< (TRNG_VERSION) Metal Fix Number Position */
#define TRNG_VERSION_MFN_Msk                  (_U_(0x7) << TRNG_VERSION_MFN_Pos)                   /**< (TRNG_VERSION) Metal Fix Number Mask */
#define TRNG_VERSION_MFN(value)               (TRNG_VERSION_MFN_Msk & ((value) << TRNG_VERSION_MFN_Pos))
#define TRNG_VERSION_Msk                      _U_(0x00070FFF)                                      /**< (TRNG_VERSION) Register Mask  */


/** \brief TRNG register offsets definitions */
#define TRNG_CR_REG_OFST               (0x00)              /**< (TRNG_CR) Control Register Offset */
#define TRNG_MR_REG_OFST               (0x04)              /**< (TRNG_MR) Mode Register Offset */
#define TRNG_PKBCR_REG_OFST            (0x08)              /**< (TRNG_PKBCR) Private Key Bus Control Register Offset */
#define TRNG_IER_REG_OFST              (0x10)              /**< (TRNG_IER) Interrupt Enable Register Offset */
#define TRNG_IDR_REG_OFST              (0x14)              /**< (TRNG_IDR) Interrupt Disable Register Offset */
#define TRNG_IMR_REG_OFST              (0x18)              /**< (TRNG_IMR) Interrupt Mask Register Offset */
#define TRNG_ISR_REG_OFST              (0x1C)              /**< (TRNG_ISR) Interrupt Status Register Offset */
#define TRNG_ODATA_REG_OFST            (0x50)              /**< (TRNG_ODATA) Output Data Register Offset */
#define TRNG_WPMR_REG_OFST             (0xE4)              /**< (TRNG_WPMR) Write Protection Mode Register Offset */
#define TRNG_WPSR_REG_OFST             (0xE8)              /**< (TRNG_WPSR) Write Protection Status Register Offset */
#define TRNG_VERSION_REG_OFST          (0xFC)              /**< (TRNG_VERSION) Version Register Offset */

